// رسائل تجريبية مؤقتة.
//
// لاحقًا لن نكتب الرسائل هنا.
// ستأتي الرسائل الحقيقية من Supabase.

const messagesData = [
  {
    name: "أحمد",
    message:
      "مرت سنوات طويلة منذ أيام الثانوية، وما زالت أجمل الذكريات تجمعنا. نسأل الله أن يبارك لك في حياتك الجديدة.",
  },

  {
    name: "محمد",
    message:
      "من أيام الدراسة والصداقة إلى هذه اللحظة الجميلة... نسأل الله أن يجعل القادم أجمل وأن يرزقك السعادة والبركة.",
  },

  {
    name: "عبد الرحمن",
    message:
      "كنا نعيش أيامًا بسيطة، ولم نكن نعرف أنها ستصبح يومًا من أجمل الذكريات. مبارك لك، وبارك الله لكما.",
  },

  {
    name: "إبراهيم",
    message:
      "اليوم تبدأ مرحلة جديدة من حياتك. نسأل الله أن يجعلها مليئة بالمودة والرحمة والخير.",
  },
];

export default messagesData;